In [69]:
import pandas as pd

In [67]:
def appreciation(initial_chocolates, last_day, n):
    # Write your code here
    chocolateDist = []
    total = 0
    for day in range(1,last_day+1):
        temp = initial_chocolates*2**(day-1)
        total += temp
        chocolateDist.append((day,temp))
        
    print(chocolateDist)
    print(f'total {total}')
    totalChoc = 0
    ansday = 1
    findChoc = int(round(total/n,0))
    print(f'findChoc {findChoc}')
    
    if findChoc < chocolateDist[0][1]:
        print('point 1')
        return ansday
    
    for x in chocolateDist:
        totalChoc += x[1]
        print(f'totalChoc {totalChoc} x {x}')
        if totalChoc > findChoc:
            ansday = x[0]
            return ansday

In [68]:
appreciation(9, 50, 10)

[(1, 9), (2, 18), (3, 36), (4, 72), (5, 144), (6, 288), (7, 576), (8, 1152), (9, 2304), (10, 4608), (11, 9216), (12, 18432), (13, 36864), (14, 73728), (15, 147456), (16, 294912), (17, 589824), (18, 1179648), (19, 2359296), (20, 4718592), (21, 9437184), (22, 18874368), (23, 37748736), (24, 75497472), (25, 150994944), (26, 301989888), (27, 603979776), (28, 1207959552), (29, 2415919104), (30, 4831838208), (31, 9663676416), (32, 19327352832), (33, 38654705664), (34, 77309411328), (35, 154618822656), (36, 309237645312), (37, 618475290624), (38, 1236950581248), (39, 2473901162496), (40, 4947802324992), (41, 9895604649984), (42, 19791209299968), (43, 39582418599936), (44, 79164837199872), (45, 158329674399744), (46, 316659348799488), (47, 633318697598976), (48, 1266637395197952), (49, 2533274790395904), (50, 5066549580791808)]
total 10133099161583607
findChoc 1013309916158361
totalChoc 9 x (1, 9)
totalChoc 27 x (2, 18)
totalChoc 63 x (3, 36)
totalChoc 135 x (4, 72)
totalChoc 279 x (5, 144)
totalChoc 567 x (6, 288)
totalChoc 1143 x (7, 576)
totalChoc 2295 x (8, 1152)
totalChoc 4599 x (9, 2304)
totalChoc 9207 x (10, 4608)
totalChoc 18423 x (11, 9216)
totalChoc 36855 x (12, 18432)
totalChoc 73719 x (13, 36864)
totalChoc 147447 x (14, 73728)
totalChoc 294903 x (15, 147456)
totalChoc 589815 x (16, 294912)
totalChoc 1179639 x (17, 589824)
totalChoc 2359287 x (18, 1179648)
totalChoc 4718583 x (19, 2359296)
totalChoc 9437175 x (20, 4718592)
totalChoc 18874359 x (21, 9437184)
totalChoc 37748727 x (22, 18874368)
totalChoc 75497463 x (23, 37748736)
totalChoc 150994935 x (24, 75497472)
totalChoc 301989879 x (25, 150994944)
totalChoc 603979767 x (26, 301989888)
totalChoc 1207959543 x (27, 603979776)
totalChoc 2415919095 x (28, 1207959552)
totalChoc 4831838199 x (29, 2415919104)
totalChoc 9663676407 x (30, 4831838208)
totalChoc 19327352823 x (31, 9663676416)
totalChoc 38654705655 x (32, 19327352832)
totalChoc 77309411319 x (33, 38654705664)
totalChoc 154618822647 x (34, 77309411328)
totalChoc 309237645303 x (35, 154618822656)
totalChoc 618475290615 x (36, 309237645312)
totalChoc 1236950581239 x (37, 618475290624)
totalChoc 2473901162487 x (38, 1236950581248)
totalChoc 4947802324983 x (39, 2473901162496)
totalChoc 9895604649975 x (40, 4947802324992)
totalChoc 19791209299959 x (41, 9895604649984)
totalChoc 39582418599927 x (42, 19791209299968)
totalChoc 79164837199863 x (43, 39582418599936)
totalChoc 158329674399735 x (44, 79164837199872)
totalChoc 316659348799479 x (45, 158329674399744)
totalChoc 633318697598967 x (46, 316659348799488)
totalChoc 1266637395197943 x (47, 633318697598976)

47

In [23]:
x = [(1, 6), (2, 12), (3, 24)]

In [55]:
x[0][1]

6

In [ ]:
def appreciation(initial_chocolates, last_day, n):
    # Write your code here
    chocolateDist = []
    total = 0
    for day in range(1,last_day+1):
        temp = initial_chocolates*2**(day-1)
        total += temp
        chocolateDist.append((day,temp))
        
    totalChoc = 0
    ansday = 1
    findChoc = round(total/n,0)
    
    if findChoc < chocolateDist[0][1]:
        return ansday
    
    for x in chocolateDist:
        totalChoc += x[1]
        if totalChoc > findChoc:
            ansday = x[0]
            return ansday

In [93]:
df = pd.read_csv("data1.csv")

In [94]:
df.head()

     Month  Monthly juice production
0  1956-01                      93.2
1  1956-02                      96.0
2  1956-03                      95.2
3  1956-04                      77.1
4  1956-05                      70.9

In [95]:
pd.to_datetime(data1['Month'][0])

Timestamp('1956-01-01 00:00:00')

In [96]:
df['Month'] = pd.to_datetime(df['Month'])

In [102]:
df.head()

            Monthly juice production
Month
1956-01-01                      93.2
1956-02-01                      96.0
1956-03-01                      95.2
1956-04-01                      77.1
1956-05-01                      70.9

In [91]:
df = pd.DataFrame(data=df, index=df['Month'])

In [ ]:
df.set_index('Month',inplace=True)

In [103]:
df2 = df.copy()

In [107]:
val1 = df2.resample('D')
val1

DatetimeIndexResampler [freq=<Day>, axis=0, closed=left, label=left, convention=start, base=0]

In [ ]:
val1.interpolate(method='spline',order=2)

In [115]:
df2.resample('Q').mean()

            Monthly juice production
Month
1956-03-31                 94.800000
1956-06-30                 70.933333
1956-09-30                 75.633333
1956-12-31                102.800000
1957-03-31                 87.333333
1957-06-30                 75.966667
1957-09-30                 78.700000
1957-12-31                106.800000
1958-03-31                 90.633333
1958-06-30                 77.600000
1958-09-30                 79.000000
1958-12-31                104.466667
1959-03-31                 87.133333
1959-06-30                 75.600000
1959-09-30                 83.300000
1959-12-31                104.766667
1960-03-31                 95.366667
1960-06-30                 75.500000
1960-09-30                 86.800000
1960-12-31                103.800000
1961-03-31                 98.233333
1961-06-30                 77.533333
1961-09-30                 85.733333
1961-12-31                113.066667
1962-03-31                 93.033333
1962-06-30                 83.266667
1962-09-30                 89.933333
1962-12-31                115.233333
1963-03-31                 97.933333
1963-06-30                 84.900000
1963-09-30                 92.500000
1963-12-31                121.133333
1964-03-31                104.466667
1964-06-30                 90.933333
1964-09-30                100.033333
1964-12-31                123.166667
1965-03-31                110.266667
1965-06-30                 95.933333
1965-09-30                101.966667
1965-12-31                126.050000

In [112]:
df2.resample('1Y').sum()

            Monthly juice production
Month
1956-12-31                    1032.5
1957-12-31                    1046.4
1958-12-31                    1055.1
1959-12-31                    1052.4
1960-12-31                    1084.4
1961-12-31                    1123.7
1962-12-31                    1144.4
1963-12-31                    1189.4
1964-12-31                    1255.8
1965-12-31                    1176.6